tests/artillery/output/artillery-variant-demo-fe.yml
config:
  target: "http://demo-fe.staging.svc.cluster.local:3000"
  phases:
    - duration: 15
      arrivalRate: 2
  defaults:
    headers:
      x-dev-session: "pr-42"
      baggage: "dev-session=pr-42"
scenarios:
  - name: "Entry E2E (intercepted app: demo-fe)"
    flow:
      - get:
          url: "/"